                  // Определить,является ли число четным или нечетным
Console.WriteLine("Введите числа 4,-3,7");
int numberA = int.Parse(Console.ReadLine());
if (numberA%2==0)
{
    Console.WriteLine("Число четное");
}
else
{
    Console.WriteLine("Число не четное");
}
//эта получилась!!точно правильно))